
read_verilog snx.v
hierarchy -check -top snx
synth            -top snx
dfflibmap -liberty  /dsk/l1/jpc/coriolis-2.x/work/DKs/FreePDK45/osu_soc/lib/files/gscl45nm.lib
abc       -liberty  /dsk/l1/jpc/coriolis-2.x/work/DKs/FreePDK45/osu_soc/lib/files/gscl45nm.lib
clean
write_blif snx.blif
